#Условия

'''
напечатать пойти гулять или не пойти гулять в зависимости от 
температура на улице
если меньшь 10 градусов, то не идти

if условие:
    действия если истино
else:
    действия если ложно

'''

#temp = int(input('input temp'))
# if temp < 10:
#     print('not please')
# else:
#     print('go gulyat')

"""

>
<
>=
<=
==
!=

ввести число
сли это ноль то   ничего не делать
если это не ноль  напечатать его

"""

'''
ввести три числа вывести наибольшее из них значение
'''



#пустая (==0) длинная (>= 10) короткая (<10)


a= input()
if a:
    if len(a) < 10:
        print('коротка')
    else:
        print('длинная')
else:
    print('пустая')