товары_чипсеки = ['Читос', 'Лейс', 'Доритос','Русская картошка', 'Кириешки']
цены_чипсеки   = [20,       24,     40,       23,                 50]

общая_стоимость = 0
все_купленные_товары = ''

a = ' '

while a!=0:
    a=int(input("выберите категорию товара 1 чипсеки 2 лимонадек 3 сухареки 0 уйти"))
    if a==1:
        i = 0
        while i < len(товары_чипсеки):
            print(i, '.', товары_чипсеки[i], цены_чипсеки[i])
            i += 1
        b=int(input(""))
        общая_стоимость += цены_чипсеки[b]
        все_купленные_товары += товары_чипсеки[b]